app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG')  ORDER BY release_date
---
    def index
      # @movies = Movie.all
      # for part one
      @m_ratings = Movie.all_ratings
      # @sorting = params[:sort]
      # @movies = Movie.all.order(@sorting)
      # for part two
      # params[:ratings].nil? ? @p_t = @m_ratings : @p_t = params[:ratings].keys

      # @movies = Movie.where(rating: @p_t).order(@sorting)

      # for part three
      @sorting = params[:sort] || session[:sort]
      # implement hash for ratings
      # @final_ratings = Hash[@m_ratings.map {|rating| [rating, rating]}] || session[:ratings] || params[:ratings]
      ## order matters
      @final_ratings =  params[:ratings] || session[:ratings] || Hash[@m_ratings.map {|rating| [rating, rating]}]